app/views/posts/create.turbo_stream.erb

INSERT INTO "posts" ("body", "comments_count", "created_at", "published_at", "slug", "title", "updated_at", "user_id") VALUES ('test testtest', 0, '2025-12-26 06:42:07.653946', NULL, 'quaerat-doloribus-ve', 'Quaerat doloribus ve', '2025-12-26 06:42:07.653946', 1) RETURNING "id"
---
                <span class="mx-2">•</span>
                <span><%= time_ago_in_words(@post.published_at || @post.created_at) %> ago</span>

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (9, 8, 7, 6, 5, 4, 3, 2)
---
        <!-- Other Posts -->
        <% Post.includes(:user, :comments).recent.where.not(id: @post.id).each do |post| %>