app/views/posts/show.html.erb

  <% if @post.comments.any? %>
    <% @post.comments.order(created_at: :desc).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 ORDER BY "comments"."created_at" DESC