app/controllers/comments_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES ('ommentaire ', '2025-12-26 06:16:43.698047', 2, '2025-12-26 06:16:43.698047', 1) RETURNING "id"
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = User.first

    if @comment.save