app/controllers/comments_controller.rb

  def set_post
    @post = Post.find_by!(slug: params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'testeee' LIMIT 1