app/controllers/posts_controller.rb

  def show
    @post = Post.includes(:user, :comments).find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 ORDER BY "comments"."created_at" DESC
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1