app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'pariatur-ex-aliqua' LIMIT 1
---
  def set_post
    @post = Post.find_by!(slug: params[:id])