app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (3, 2)
SELECT "posts".* FROM "posts" WHERE (title ILIKE '%adip%' OR body ILIKE '%adip%') ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.includes(:user, :comments).all

INSERT INTO "posts" ("body", "comments_count", "created_at", "published_at", "slug", "title", "updated_at", "user_id") VALUES ('test', 0, '2025-12-26 05:52:47.544554', '2025-12-26 05:52:00', 'rwfrf', 'rwfrf', '2025-12-26 05:52:47.544554', 1) RETURNING "id"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("body", "comments_count", "created_at", "published_at", "slug", "title", "updated_at", "user_id") VALUES ('Consequatur consect', 0, '2025-12-26 07:10:54.527519', '2021-05-14 06:36:00', 'amet-rerum-eos-lib', 'Amet rerum eos lib', '2025-12-26 07:10:54.527519', 1) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = User.first || User.create!(email: "user@example.com", name: "User", role: "member")

    if @post.save

UPDATE "posts" SET "slug" = 'nisi-est-ut', "title" = 'Nisi est ut ', "updated_at" = '2025-12-26 07:19:23.149510' WHERE "posts"."id" = 11
---
  def update
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = 11
---
  def destroy
    @post_id = @post.id
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'nisi-est-ut' LIMIT 1
---
  def set_post
    @post = Post.find_by!(slug: params[:id])